from random import*

answers = ['Бесспорно', 'Мне кажется - да', 'Пока неясно', 'Попробуй снова', 'Даже не думай', 
           'Предрешено', 'Вероятнее всего', 'Спроси позже', 'Мой ответ - нет', 'Никаких сомнений', 
           'Хорошие перспективы', 'Лучше не рассказывать', 'По моим данным - нет', 'Определённо да', 
           'Знаки говорят - да', 'Сейчас нельзя предсказать', 'Перспективы не очень хорошие', 
           'Можешь быть уверен в этом', 'Да', 'Сконцентрируйся и спроси опять', 'Весьма сомнительно'
]
name = input("Введите ваше имя  ")
print('Привет,', name, '. Приготовься узать ответы на все свои вопросы:)')

def answer():
    while True:
        q = input('Задай свой вопрос  ')
        print('Ответ:', choice(answers))
        print('Хотите спросить что-то еще? - Напишите да') 
        repeat = input()
        if repeat != 'да':
            print('Возвращайся если возникнут вопросы!')
            break
        else:
            continue       
answer()
  